Masmiseim36/nxpSDK/devices/MIMXRT1189/drivers/fsl_lpspi_edma.c
    if (handle->txData != NULL)
    {
        transferConfigTx.srcAddr   = (uint32_t)(handle->txData);
        transferConfigTx.srcOffset = 1;
    }
    else
    {
        transferConfigTx.srcAddr   = (uint32_t)(&handle->txBuffIfNull);
        transferConfigTx.srcOffset = 0;
    }

    transferConfigTx.destOffset = 0;

    transferConfigTx.srcTransferSize = kEDMA_TransferSize1Bytes;

    addrOffset = 0U;
    /*
     * $Branch Coverage Justification$
     * $ref fsl_lpspi_edma_c_ref_1$
     */
    switch (handle->bytesEachRead)
    {
        case (1U):
            transferConfigTx.destTransferSize = kEDMA_TransferSize1Bytes;
            transferConfigTx.minorLoopBytes   = 1;
            if (handle->isByteSwap)
            {
                addrOffset = 3;
            }
            break;

        case (2U):
            transferConfigTx.destTransferSize = kEDMA_TransferSize2Bytes;
            transferConfigTx.minorLoopBytes   = 2;

            if (handle->isByteSwap)
            {
                addrOffset = 2;
            }
            break;

        case (4U):
            transferConfigTx.destTransferSize = kEDMA_TransferSize4Bytes;
            transferConfigTx.minorLoopBytes   = 4;
            break;

        default:
            transferConfigTx.destTransferSize = kEDMA_TransferSize1Bytes;
            transferConfigTx.minorLoopBytes   = 1;
            assert(false);
            break;
    }

    transferConfigTx.destAddr = (uint32_t)txAddr + addrOffset;

    transferConfigTx.majorLoopCounts = handle->writeRegRemainingTimes;

    if (isThereExtraTxBytes)
    {
        handle->lastTimeTCD = softwareTCD_extraBytes;
    }
    else if (handle->isPcsContinuous)
    {
        handle->lastTimeTCD = softwareTCD_pcsContinuous;
    }
    else
    {
        handle->lastTimeTCD = NULL;
    }

    if (handle->isMultiDMATransmit)
    {
        transferConfigTx.majorLoopCounts = handle->dataBytesEveryTime;
        if (handle->isPcsContinuous)
        {
            /* Pcs-continue mode is not supported in Multi DMA.
               Please use no-continue mode and use GPIO control CS pin*/
            LPSPI_SetPCSContinous(base, false);
            assert(false);
        }

        EDMA_SetTransferConfig(handle->edmaTxDataToTxRegHandle->base, handle->edmaTxDataToTxRegHandle->channel,
                               &transferConfigTx, NULL);
        (void)memcpy(&handle->transferConfigTx, &transferConfigTx, sizeof(edma_transfer_config_t));
        (void)memcpy(&handle->transferConfigRx, &transferConfigRx, sizeof(edma_transfer_config_t));
    }
    else
    {
        transferConfigTx.majorLoopCounts = handle->writeRegRemainingTimes;
        EDMA_SetTransferConfig(handle->edmaTxDataToTxRegHandle->base, handle->edmaTxDataToTxRegHandle->channel,
                               &transferConfigTx, handle->lastTimeTCD);
    }
    EDMA_StartTransfer(handle->edmaTxDataToTxRegHandle);
    EDMA_StartTransfer(handle->edmaRxRegToRxDataHandle);
    LPSPI_EnableDMA(base, (uint32_t)kLPSPI_RxDmaEnable | (uint32_t)kLPSPI_TxDmaEnable);

    return kStatus_Success;
}

/*!
 * brief LPSPI master transfer data using eDMA.
 *
 * This function transfers data using eDMA. This is a non-blocking function, which returns right away. When all data
 * is transferred, the callback function is called.
 *
 * Note:
 * The transfer data size should be an integer multiple of bytesPerFrame if bytesPerFrame is less than or equal to 4.
 * For bytesPerFrame greater than 4:
 * The transfer data size should be equal to bytesPerFrame if the bytesPerFrame is not an integer multiple of 4.
 * Otherwise, the transfer data size can be an integer multiple of bytesPerFrame.
 *
 * param base LPSPI peripheral base address.
 * param handle pointer to lpspi_master_edma_handle_t structure which stores the transfer state.
 * param transfer pointer to lpspi_transfer_t structure.
 * return status of status_t.
 */
status_t LPSPI_MasterTransferEDMA(LPSPI_Type *base, lpspi_master_edma_handle_t *handle, lpspi_transfer_t *transfer)
{
    status_t status = kStatus_Fail;
    status          = LPSPI_MasterTransferPrepareEDMALite(base, handle, transfer->configFlags);
    if (kStatus_Success != status)
    {
        return status;
    }
    return LPSPI_MasterTransferEDMALite(base, handle, transfer);
}

static void EDMA_LpspiMasterCallback(edma_handle_t *edmaHandle,
                                     void *g_lpspiEdmaPrivateHandle,
                                     bool transferDone,
                                     uint32_t tcds)
{
    assert(edmaHandle != NULL);
    assert(g_lpspiEdmaPrivateHandle != NULL);

    uint32_t readData;
    status_t callbackStatus = kStatus_Success;
    lpspi_master_edma_private_handle_t *lpspiEdmaPrivateHandle;
    lpspi_master_edma_handle_t *lpspiEdmaHandle;
    lpspiEdmaPrivateHandle = (lpspi_master_edma_private_handle_t *)g_lpspiEdmaPrivateHandle;

    lpspiEdmaHandle             = lpspiEdmaPrivateHandle->handle;
    size_t rxRemainingByteCount = lpspiEdmaHandle->rxRemainingByteCount;
    uint8_t bytesLastRead       = lpspiEdmaHandle->bytesLastRead;
    bool isByteSwap             = lpspiEdmaHandle->isByteSwap;

    bool lpspitxDmaUpdate = false;
    bool lpspirxDmaUpdate = false;

    LPSPI_DisableDMA(lpspiEdmaPrivateHandle->base, (uint32_t)kLPSPI_TxDmaEnable | (uint32_t)kLPSPI_RxDmaEnable);

    if (!transferDone)
    {
        callbackStatus = kStatus_LPSPI_Error;
    }
    else
    {
        if (lpspiEdmaHandle->isMultiDMATransmit)
        {
            /* multi DMA transmit */
            lpspiEdmaHandle->dmaTransmitTime--;
            if (lpspiEdmaHandle->dmaTransmitTime >= 1U)
            {
                if (lpspiEdmaHandle->txData != NULL)
                {
                    lpspitxDmaUpdate = true;
                    lpspiEdmaHandle->transferConfigTx.srcAddr += lpspiEdmaHandle->dataBytesEveryTime;
                }
                if (lpspiEdmaHandle->rxData != NULL)
                {
                    lpspirxDmaUpdate = true;
                    lpspiEdmaHandle->transferConfigRx.destAddr += lpspiEdmaHandle->dataBytesEveryTime;
                }
                /* The last time - 1 time, need check the lastTime data bytes */
                if (lpspiEdmaHandle->dmaTransmitTime == 1U)
                {
                    if (lpspiEdmaHandle->lastTimeDataBytes != lpspiEdmaHandle->dataBytesEveryTime)
                    {
                        /* Need update count if last time count is not dataBytesEveryTime*/
                        lpspiEdmaHandle->transferConfigTx.majorLoopCounts = lpspiEdmaHandle->lastTimeDataBytes;
                        lpspiEdmaHandle->transferConfigRx.majorLoopCounts = lpspiEdmaHandle->lastTimeDataBytes;
                        lpspitxDmaUpdate                                  = true;
                        lpspirxDmaUpdate                                  = true;
                    }
                }
                /* Update RX channel first */
                if (lpspirxDmaUpdate)
                {
                    EDMA_SetTransferConfig(lpspiEdmaHandle->edmaRxRegToRxDataHandle->base,
                                           lpspiEdmaHandle->edmaRxRegToRxDataHandle->channel,
                                           &lpspiEdmaHandle->transferConfigRx, NULL);
                }
                EDMA_StartTransfer(lpspiEdmaHandle->edmaRxRegToRxDataHandle);
                /* Update TX channel */
                if (lpspitxDmaUpdate)
                {
                    EDMA_SetTransferConfig(lpspiEdmaHandle->edmaTxDataToTxRegHandle->base,
                                           lpspiEdmaHandle->edmaTxDataToTxRegHandle->channel,
                                           &lpspiEdmaHandle->transferConfigTx, NULL);
                }
                EDMA_StartTransfer(lpspiEdmaHandle->edmaTxDataToTxRegHandle);

                LPSPI_EnableDMA(lpspiEdmaPrivateHandle->base,
                                (uint32_t)kLPSPI_TxDmaEnable | (uint32_t)kLPSPI_RxDmaEnable);
                /* Continue DMA transmit*/
                return;
            }
            else
            {
                /* Transmit complete */
            }
        }
        else
        {
            /* Once DMA transfer */
            if (lpspiEdmaPrivateHandle->handle->isThereExtraRxBytes)
            {
                while (LPSPI_GetRxFifoCount(lpspiEdmaPrivateHandle->base) == 0U)
                {
                }
                readData = LPSPI_ReadData(lpspiEdmaPrivateHandle->base);
                if (lpspiEdmaPrivateHandle->handle->rxData != NULL)
                {
                    LPSPI_SeparateEdmaReadData(
                        &(lpspiEdmaPrivateHandle->handle->rxData[rxRemainingByteCount - bytesLastRead]), readData,
                        bytesLastRead, isByteSwap);
                }
            }
            /* Transmit complete */
        }
    }

    lpspiEdmaPrivateHandle->handle->state = (uint8_t)kLPSPI_Idle;

    if (lpspiEdmaPrivateHandle->handle->callback != NULL)
    {
        lpspiEdmaPrivateHandle->handle->callback(lpspiEdmaPrivateHandle->base, lpspiEdmaPrivateHandle->handle,
                                                 callbackStatus, lpspiEdmaPrivateHandle->handle->userData);
    }
}

/*!
 * brief LPSPI master aborts a transfer which is using eDMA.
 *
 * This function aborts a transfer which is using eDMA.
 *
 * param base LPSPI peripheral base address.
 * param handle pointer to lpspi_master_edma_handle_t structure which stores the transfer state.
 */
void LPSPI_MasterTransferAbortEDMA(LPSPI_Type *base, lpspi_master_edma_handle_t *handle)
{
    assert(handle != NULL);

    LPSPI_DisableDMA(base, (uint32_t)kLPSPI_RxDmaEnable | (uint32_t)kLPSPI_TxDmaEnable);

    EDMA_AbortTransfer(handle->edmaRxRegToRxDataHandle);
    EDMA_AbortTransfer(handle->edmaTxDataToTxRegHandle);

